OpenFOAM file/OpenFOAM/cfdm-v2412/run/tutorials/incompressible/pimpleFoam/RAS/pitzDaily/0/epsilon
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2412                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      epsilon;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -3 0 0 0 0];

internalField   uniform 14.855;

boundaryField
{
  inlet
    {
        type fixedValue;
        value uniform 0.1;
    }

    outlet
    {
        type zeroGradient;
    }

    top
    {
        type epsilonWallFunction;
        value uniform 0.1;
    }

    bottom
    {
        type epsilonWallFunction;
        value uniform 0.1;
    }

    front_back
    {
        type patch;
    }
}


// ************************************************************************* //
